"""
Модуль для загрузки и хранения конфигурационных параметров приложения.

Загружает переменные окружения из файла .env и предоставляет доступ
к критически важным конфигурационным данным для работы приложения.

Импорты:
    - os: Для работы с переменными окружения и системными функциями
    - dotenv.load_dotenv: Для загрузки переменных окружения из файла .env

Переменные:
    - DATA_SOURCE: DSN строка для подключения к базе данных

Функции:
    - load_dotenv: Загружает переменные окружения из указанного файла
"""

import os

from dotenv import load_dotenv

load_dotenv('.env')

DATA_SOURCE = os.getenv('DATA_SOURCE')
